<?php

$lang['required']			= "Το πεδίο %s είναι απαραίτητο.";
$lang['isset']				= "Το πεδίο %s πρέπει να έχει τιμή.";
$lang['valid_email']		= "Το πεδίο %s πρέπει να περιέχει έγκυρη διεύθυνση ηλεκτρονικού ταχυδρομείου.";
$lang['valid_emails']		= "Το πεδίο %s πρέπει να περιέχει έγκυρες διευθύνσεις ηλεκτρονικού ταχυδρομείου.";
$lang['valid_url']			= "Το πεδίο %s πρέπει να περιέχει έγκυρη διεύθυνση ιστότοπου.";
$lang['valid_ip']			= "Το πεδίο %s πρέπει να περιέχει έγκυρη διεύθυνση IP.";
$lang['min_length']			= "Το πεδίο %s πρέπει να έχει τουλάχιστον %s χαρακτήρες μήκος.";
$lang['max_length']			= "Το πεδίο %s δε μπορεί να υπερβαίνει τους %s χαρακτήρες σε μήκος.";
$lang['exact_length']		= "Το πεδίο %s πρέπει να είναι ακριβώς %s χαρακτήρες σε μήκος.";
$lang['alpha']				= "Το πεδίο %s πρέπει να περιέχει μόνο αλφαβητικούς χαρακτήρες.";
$lang['alpha_numeric']		= "Το πεδίο %s πρέπει να περιέχει μόνο αλφαριθμητικούς χαρακτήρες.";
$lang['alpha_dash']			= "Το πεδίο %s πρέπει να περιέχει μόνο αλφαβητικούς χαρακτήρες, κάτω παύλες, και παύλες.";
$lang['numeric']			= "Το πεδίο %s πρέπει να περιέχει μόνο αριθμούς.";
$lang['is_numeric']			= "Το πεδίο %s πρέπει να περιέχει μόνο αριθμητικούς χαρακτήρες.";
$lang['integer']			= "Το πεδίο %s πρέπει να περιέχει έναν ακέραιο.";
$lang['regex_match']		= "Το πεδίο %s δεν έχει τη σωστή μορφοποίηση.";
$lang['matches']			= "Το πεδίο %s πρέπει να ταιριάζει με το πεδίο %s.";
$lang['is_unique'] 			= "Το πεδίο %s πρέπει να περιέχει μοναδική τιμή.";
$lang['is_natural']			= "Το πεδίο %s πρέπει να περιέχι μόνο θετικούς αριθμούς.";
$lang['is_natural_no_zero']	= "Το πεδίο %s πρέπει να περιέχι μόνο θετικούς αριθμούς μεγαλύτερους του μηδενός.";
$lang['decimal']			= "Το πεδίο %s πρέπει να περιέχει έναν δεδκαδικό αριθμό.";
$lang['less_than']			= "Το πεδίο %s πρέπει να περιέχει έναν αριθμό μικρότερο του %s.";
$lang['greater_than']		= "Το πεδίο %s πρέπει να περιέχει έναν αριθμό μεγαλύτερο του %s.";
$lang['alpha_greek']	= "Το πεδίο %s πρέπει να περιέχει μόνο ελληνικούς χαρακτήρες.";

/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */